name: "weed_detector"
platform: "onnxruntime_onnx"
max_batch_size : 0
input [
  {
    name: "images"
    data_type: TYPE_FP32
    format: FORMAT_NCHW
    dims: [3, 512, 512]
    reshape { shape: [1, 3, 512, 512] }
  }
]
output [
  {
    name: "output"
    data_type: TYPE_FP32
    dims: [1, 16128, 7]
  }
]